#!coding:utf8
import sys
reload(sys)
sys.setdefaultencoding('utf8')

'''
0 正确
1-100 用户类错误
    1-50 登陆
    50-100 注册
    101-200 短信宝的错误
'''
_code = {
	0 : u'success' ,
	1 : u'用户不存在' ,
	2 : u'用户未激活' ,
	3 : u'密码输入错误' ,
    4 : u'请填写正确完整信息',
    5 : u'LDAP绑定失败',
    6 : u'查找user DN失败',
    7 : u'用户名密码不能为空',
    8 : u'查找user 群组失败', 
    9 : u'没有web_log组权限，无法使用kill -3',   
    51 : '请填写相应信息',
    52 : '用户手机号不正确',
    53 : '密码不一致' ,
    54 : '注册失败' ,
    55 : '手机号已存在，请更换手机号',
    56 : '查询所有用户时出错' ,
    57 : '用户激活失败',
    58 : '密码小于8个字符',
    59 : '修改用户失败',
    60 : '查询用户失败',
    101 : 'No Login Code',
    102 : 'Unknown Error',
    103 : 'DB Connection Failed',
    104 : '短信接口连接数据库失败',
    105 : '发送短信时写入日志时出错',
    106 : '获取短信余额错误',
    107 : '获取短信日志失败',
    201 : '认证失败',
    202 : 'session_key获取失败',
    203 : '解密userinfo失败',
    204 : '该微信用户已存在，无法重复注册',
    205 : '注册信息添加到数据库失败',
    206 : '读取用户注册信息失败',
    207 : '该用户不存在',
    208 : '该qr_code对应的书籍不存在',
    209 : 'book action 参数错误',
    210 : '可惜了，此本书已借出',
    211 : '创建借书记录失败，内部错误',
    212 : '你并没有借这本书',

}